# NextSymDef

## Description
Function NextSymDef returns a handle to the next definition in the symbol library after the referenced symbol. If the end of the list has been reached, the function returns NIL.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION NextSymDef(symHd : HANDLE) : HANDLE;
```

```python

def vs.NextSymDef(symHd):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symHd|HANDLE|Handle to symbol definition in library.|

## Version
Availability: from MiniCAD
## Category
* Document List Handling